---
kind: type
id: T:Autodesk.Revit.DB.BuiltInFailures.CurtainGridFamilyFailures
source: html/35e77e14-b020-50ef-133f-1c029c28429e.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CurtainGridFamilyFailures

Failures about CurtainGrid Family.

## Syntax (C#)
```csharp
public static class CurtainGridFamilyFailures
```